# Bar Terminations Data Crank Type Id At Start Property

Source: https://www.revitapidocs.com/2026/8cbf6d7a-cb71-eec5-2836-8c4502cd6279.htm

---

| Bar Terminations Data Crank Type Id At Start Property |
| --- |

Identifies the crank type at the start of bar.
 Setting this property to a valid value, will set the HookTypeIdAtStart and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId CrankTypeIdAtStart { get; set; }
```

```
Public Property CrankTypeIdAtStart As ElementId
	Get
	Set
```

```
public:
property ElementId^ CrankTypeIdAtStart {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member CrankTypeIdAtStart : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: crankTypeIdAtStart doesn't represent a crank type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace